RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/ef_ctrl_reg.h
    /* 0x81C : ef_reserved */
    union {
        struct
        {
            uint32_t ef_reserved : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } ef_reserved;

    /* 0x820 : ef_if_ana_trim_0 */
    union {
        struct
        {
            uint32_t ef_if_ana_trim_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_ana_trim_0;

    /* 0x824 : ef_if_sw_usage_0 */
    union {
        struct
        {
            uint32_t ef_if_sw_usage_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_sw_usage_0;

    /* 0x828  reserved */
    uint8_t RESERVED0x828[472];

    /* 0xA00 : ef_crc_ctrl_0 */
    union {
        struct
        {
            uint32_t ef_crc_busy        : 1;  /* [    0],          r,        0x0 */
            uint32_t ef_crc_trig        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ef_crc_en          : 1;  /* [    2],        r/w,        0x1 */
            uint32_t ef_crc_mode        : 1;  /* [    3],        r/w,        0x0 */
            uint32_t ef_crc_error       : 1;  /* [    4],          r,        0x0 */
            uint32_t ef_crc_dout_inv_en : 1;  /* [    5],        r/w,        0x1 */
            uint32_t ef_crc_dout_endian : 1;  /* [    6],        r/w,        0x0 */
            uint32_t ef_crc_din_endian  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t ef_crc_int         : 1;  /* [    8],          r,        0x0 */
            uint32_t ef_crc_int_clr     : 1;  /* [    9],        r/w,        0x1 */
            uint32_t ef_crc_int_set     : 1;  /* [   10],        r/w,        0x0 */
            uint32_t ef_crc_lock        : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ef_crc_slp_n       : 16; /* [31:16],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_0;

    /* 0xA04 : ef_crc_ctrl_1 */
    union {
        struct
        {
            uint32_t ef_crc_data_0_en : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_1;

    /* 0xA08 : ef_crc_ctrl_2 */
    union {
        struct
        {
            uint32_t ef_crc_data_1_en : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_2;

    /* 0xA0C : ef_crc_ctrl_3 */
    union {
        struct
        {
            uint32_t ef_crc_iv : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_3;

    /* 0xA10 : ef_crc_ctrl_4 */
    union {
        struct
        {
            uint32_t ef_crc_golden : 32; /* [31: 0],        r/w, 0xc2a8fa9dL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_4;

    /* 0xA14 : ef_crc_ctrl_5 */
    union {
        struct
        {
            uint32_t ef_crc_dout : 32; /* [31: 0],          r, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_5;
};

typedef volatile struct ef_ctrl_reg ef_ctrl_reg_t;

#endif /* __EF_CTRL_REG_H__ */
